In [37]:
import numpy as np
import pandas as pd
import os
import glob
import matplotlib.pyplot as plt
import seaborn as sns

In [87]:
path = "F:/NeU 2nd Sem/ADM/Assignment 2"
csv_pattern = os.path.join(path, "*.csv")
file_list = glob.glob(csv_pattern)

print("Created dataframe names: ")
for file in file_list:
    print(os.path.basename(file)[:-4])
    vars()[os.path.basename(file)[:-4]] = pd.read_csv(file)

Created dataframe names:
campaign_data
coupon_item_mapping
customer_demographics
customer_demographics_new
customer_transaction_data
final_train
item_data
smote
test
train

## Train.csv

In [6]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78369 entries, 0 to 78368
Data columns (total 5 columns):
id                   78369 non-null int64
campaign_id          78369 non-null int64
coupon_id            78369 non-null int64
customer_id          78369 non-null int64
redemption_status    78369 non-null int64
dtypes: int64(5)
memory usage: 3.0 MB

In [7]:
train.head(10)

   id  campaign_id  coupon_id  customer_id  redemption_status
0   1           13         27         1053                  0
1   2           13        116           48                  0
2   6            9        635          205                  0
3   7           13        644         1050                  0
4   9            8       1017         1489                  0
5  11           11        795          793                  0
6  14            9        444          590                  0
7  15           29        538          368                  0
8  17           30        857          523                  0
9  19            2        559          679                  0

In [8]:
train.describe()

,id,campaign_id,coupon_id,customer_id,redemption_status
count,78369.000000,78369.000000,78369.000000,78369.000000,78369.000000
mean,64347.975449,13.974441,566.363243,787.451888,0.009302
std,37126.440855,8.019215,329.966054,456.811339,0.095999
min,1.000000,1.000000,1.000000,1.000000,0.000000
25%,32260.000000,8.000000,280.000000,399.000000,0.000000
50%,64318.000000,13.000000,597.000000,781.000000,0.000000
75%,96577.000000,13.000000,857.000000,1190.000000,0.000000
max,128595.000000,30.000000,1115.000000,1582.000000,1.000000

In [9]:
train.isnull().sum()

id                   0
campaign_id          0
coupon_id            0
customer_id          0
redemption_status    0
dtype: int64

In [10]:
train.redemption_status.value_counts()

0    77640
1      729
Name: redemption_status, dtype: int64

In [11]:
total = train.redemption_status.value_counts()
total = total.reset_index()
total.columns = ["Redemption_Status", "Count"]

percent = train.redemption_status.value_counts() / len(train.iloc[:,0]) * 100
total["Percent"] = percent
print(total)

   Redemption_Status  Count    Percent
0                  0  77640  99.069785
1                  1    729   0.930215

In [12]:
len(train.iloc[:,1])

78369

## Campaign_data.csv

In [13]:
campaign_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 4 columns):
campaign_id      28 non-null int64
campaign_type    28 non-null object
start_date       28 non-null object
end_date         28 non-null object
dtypes: int64(1), object(3)
memory usage: 976.0+ bytes

In [14]:
campaign_data.head(10)

   campaign_id campaign_type start_date  end_date
0           24             Y   21/10/13  20/12/13
1           25             Y   21/10/13  22/11/13
2           20             Y   07/09/13  16/11/13
3           23             Y   08/10/13  15/11/13
4           21             Y   16/09/13  18/10/13
5           22             X   16/09/13  18/10/13
6           18             X   10/08/13  04/10/13
7           19             Y   26/08/13  27/09/13
8           17             Y   29/07/13  30/08/13
9           16             Y   15/07/13  16/08/13

In [15]:
ser = pd.Series(campaign_data.campaign_id.unique())
ser.sort_values()

21     1
22     2
18     3
20     4
19     5
17     6
16     7
15     8
14     9
13    10
11    11
12    12
10    13
9     16
8     17
6     18
7     19
2     20
4     21
5     22
3     23
0     24
1     25
27    26
26    27
25    28
24    29
23    30
dtype: int64

## customer_demographics

In [88]:
customer_demographics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 760 entries, 0 to 759
Data columns (total 7 columns):
customer_id       760 non-null int64
age_range         760 non-null object
marital_status    431 non-null object
rented            760 non-null int64
family_size       760 non-null object
no_of_children    222 non-null object
income_bracket    760 non-null int64
dtypes: int64(3), object(4)
memory usage: 41.6+ KB

In [89]:
print(customer_demographics["no_of_children"].value_counts())

1     107
3+     60
2      55
Name: no_of_children, dtype: int64

In [90]:
customer_demographics["no_of_children"].fillna(0, inplace=True)

In [93]:
customer_demographics[(customer_demographics["no_of_children"]!=0) & customer_demographics.marital_status.isnull()].fillna("Married", inplace=True)

In [95]:
customer_demographics[(customer_demographics["no_of_children"]!=0) & customer_demographics.marital_status.isnull()] = customer_demographics[(customer_demographics["no_of_children"]!=0) & customer_demographics.marital_status.isnull()].fillna("Married")

In [101]:
customer_demographics[(customer_demographics["no_of_children"]==0) & (customer_demographics.marital_status.isnull())]["family_size"].value_counts()

1    183
2     89
Name: family_size, dtype: int64

In [106]:
customer_demographics[(customer_demographics["no_of_children"]==0) & (customer_demographics.marital_status.isnull()) & (customer_demographics["family_size"] == "2")] = customer_demographics[(customer_demographics["no_of_children"]==0) & (customer_demographics.marital_status.isnull()) & (customer_demographics["family_size"] == "2")].fillna("Married")

In [110]:
customer_demographics[(customer_demographics["no_of_children"]==0) & (customer_demographics.marital_status.isnull()) & (customer_demographics["family_size"] == "1")] = customer_demographics[(customer_demographics["no_of_children"]==0) & (customer_demographics.marital_status.isnull()) & (customer_demographics["family_size"] == "1")].fillna("Single")

In [111]:
customer_demographics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 760 entries, 0 to 759
Data columns (total 7 columns):
customer_id       760 non-null int64
age_range         760 non-null object
marital_status    760 non-null object
rented            760 non-null int64
family_size       760 non-null object
no_of_children    760 non-null object
income_bracket    760 non-null int64
dtypes: int64(3), object(4)
memory usage: 41.6+ KB

In [112]:
customer_demographics.head(20)

,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket
0,1,70+,Married,0,2,0,4
1,6,46-55,Married,0,2,0,5
2,7,26-35,Married,0,3,1,3
3,8,26-35,Married,0,4,2,6
4,10,46-55,Single,0,1,0,5
5,11,70+,Single,0,2,0,1
6,12,46-55,Married,0,2,0,7
7,13,36-45,Single,0,1,0,2
8,14,26-35,Married,1,2,0,6
9,15,46-55,Married,0,2,0,6
10,17,36-45,Single,0,1,0,5
11,19,46-55,Single,0,1,0,3
12,22,36-45,Single,0,2,0,4
13,27,36-45,Married,0,2,0,8
14,28,46-55,Married,0,2,0,1
15,30,70+,Single,0,1,0,5
16,31,36-45,Single,0,5+,3+,2
17,33,46-55,Married,0,5+,3+,9
18,35,18-25,Married,0,2,0,4
19,36,36-45,Married,0,2,0,4

In [113]:
customer_demographics.to_csv("F:/NeU 2nd Sem/ADM/Assignment 2/customer_demographics_new.csv")